Generate_blockMeshDict/cylinder/original/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.5 0 -0.05)
    (1.0 0 -0.05)
    (10.5 0 -0.05)
    (10.5 0.70711 -0.05)
    (0.70711 0.70711 -0.05)
    (0.353555 0.353555 -0.05)
    (10.5 1.0 -0.05)
    (0.70711 1.0 -0.05)
    (0 1.0 -0.05)
    (0 1.0 -0.05)
    (0 0.5 -0.05)
    (-0.5 0 -0.05)
    (-1.0 0 -0.05)
    (-4.5 0 -0.05)
    (-4.5 0.70711 -0.05)
    (-0.70711 0.70711 -0.05)
    (-0.353555 0.353555 -0.05)
    (-4.5 1.0 -0.05)
    (-0.70711 1.0 -0.05)
    (0.5 0 0.05)
    (1.0 0 0.05)
    (10.5 0 0.05)
    (10.5 0.70711 0.05)
    (0.70711 0.70711 0.05)
    (0.353555 0.353555 0.05)
    (10.5 1.0 0.05)
    (0.70711 1.0 0.05)
    (0 1.0 0.05)
    (0 1.0 0.05)
    (0 0.5 0.05)
    (-0.5 0 0.05)
    (-1.0 0 0.05)
    (-4.5 0 0.05)
    (-4.5 0.70711 0.05)
    (-0.70711 0.70711 0.05)
    (-0.353555 0.353555 0.05)
    (-4.5 1.0 0.05)
    (-0.70711 1.0 0.05)
);

blocks
(
    hex (5 4 9 10 24 23 28 29) (85 85 1) simpleGrading (3 1 1)
    hex (0 1 4 5 19 20 23 24) (85 85 1) simpleGrading (3 1 1)
    hex (1 2 3 4 20 21 22 23) (380 85 1) simpleGrading (10 1 1)
    hex (4 3 6 7 23 22 25 26) (380 5 1) simpleGrading (10 0.333 1)
    hex (9 4 7 8 28 23 26 27) (85 5 1) simpleGrading (1 0.333 1)
    hex (15 16 10 9 34 35 29 28) (85 85 1) simpleGrading (0.333 1 1)
    hex (12 11 16 15 31 30 35 34) (85 85 1) simpleGrading (0.333 1 1)
    hex (13 12 15 14 32 31 34 33) (140 85 1) simpleGrading (0.1 1 1)
    hex (14 15 18 17 33 34 37 36) (140 5 1) simpleGrading (0.1 0.333 1)
    hex  (15 9 8 18 34 28 27 37) (85 5 1) simpleGrading (1 0.333 1)
);

edges
(
    arc 0 5 (0.433 0.25 -0.05)
    arc 5 10 (0.25 0.433 -0.05)
    arc 1 4 (0.5 0.866 -0.05)
    arc 4 9 (0.5 0.866 -0.05)
    arc 19 24 (0.433 0.25 0.05)
    arc 24 29 (0.25 0.433 0.05)
    arc 20 23 (0.5 0.866 0.05)
    arc 23 28 (0.5 0.866 0.05)
    arc 11 16 (-0.433 0.25 -0.05)
    arc 16 10 (-0.25 0.433 -0.05)
    arc 12 15 (-0.5 0.866 -0.05)
    arc 15 9 (-0.5 0.866 -0.05)
    arc 30 35 (-0.433 0.25 0.05)
    arc 35 29 (-0.25 0.433 0.05)
    arc 31 34 (-0.5 0.866 0.05)
    arc 34 28 (-0.5 0.866 0.05)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (14 13 32 33)
            (17 14 33 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 22 21)
            (3 6 25 22)
        );
    }
    top
    {
        type wall;
        faces
        (
            (7 8 27 26)
            (6 7 26 25)
            (8 18 37 27)
            (18 17 36 37)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (10 5 24 29)
            (5 0 19 24)
            (16 10 29 35)
            (11 16 35 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
